sipeed/M1s_BL808_SDK/components/stage/dsp2/dsp2_drv/dsp2_reg/dsp2_middle_reg_a0.h
/* 0x238 : LSC_coeff_G_A */
#define DSP2_MIDDLE_LSC_COEFF_G_A_OFFSET                         (0x238)
#define DSP2_MIDDLE_G_ACOEFF_W                                   DSP2_MIDDLE_G_ACOEFF_W
#define DSP2_MIDDLE_G_ACOEFF_W_POS                               (0U)
#define DSP2_MIDDLE_G_ACOEFF_W_LEN                               (23U)
#define DSP2_MIDDLE_G_ACOEFF_W_MSK                               (((1U<<DSP2_MIDDLE_G_ACOEFF_W_LEN)-1)<<DSP2_MIDDLE_G_ACOEFF_W_POS)
#define DSP2_MIDDLE_G_ACOEFF_W_UMSK                              (~(((1U<<DSP2_MIDDLE_G_ACOEFF_W_LEN)-1)<<DSP2_MIDDLE_G_ACOEFF_W_POS))

/* 0x23C : LSC_coeff_G_BE */
#define DSP2_MIDDLE_LSC_COEFF_G_BE_OFFSET                        (0x23C)
#define DSP2_MIDDLE_G_BCOEFF_W                                   DSP2_MIDDLE_G_BCOEFF_W
#define DSP2_MIDDLE_G_BCOEFF_W_POS                               (0U)
#define DSP2_MIDDLE_G_BCOEFF_W_LEN                               (13U)
#define DSP2_MIDDLE_G_BCOEFF_W_MSK                               (((1U<<DSP2_MIDDLE_G_BCOEFF_W_LEN)-1)<<DSP2_MIDDLE_G_BCOEFF_W_POS)
#define DSP2_MIDDLE_G_BCOEFF_W_UMSK                              (~(((1U<<DSP2_MIDDLE_G_BCOEFF_W_LEN)-1)<<DSP2_MIDDLE_G_BCOEFF_W_POS))
#define DSP2_MIDDLE_G_ECOEFF_W                                   DSP2_MIDDLE_G_ECOEFF_W
#define DSP2_MIDDLE_G_ECOEFF_W_POS                               (16U)
#define DSP2_MIDDLE_G_ECOEFF_W_LEN                               (13U)
#define DSP2_MIDDLE_G_ECOEFF_W_MSK                               (((1U<<DSP2_MIDDLE_G_ECOEFF_W_LEN)-1)<<DSP2_MIDDLE_G_ECOEFF_W_POS)
#define DSP2_MIDDLE_G_ECOEFF_W_UMSK                              (~(((1U<<DSP2_MIDDLE_G_ECOEFF_W_LEN)-1)<<DSP2_MIDDLE_G_ECOEFF_W_POS))

/* 0x240 : LSC_coeff_G_CD */
#define DSP2_MIDDLE_LSC_COEFF_G_CD_OFFSET                        (0x240)
#define DSP2_MIDDLE_G_DCOEFF_W                                   DSP2_MIDDLE_G_DCOEFF_W
#define DSP2_MIDDLE_G_DCOEFF_W_POS                               (0U)
#define DSP2_MIDDLE_G_DCOEFF_W_LEN                               (23U)
#define DSP2_MIDDLE_G_DCOEFF_W_MSK                               (((1U<<DSP2_MIDDLE_G_DCOEFF_W_LEN)-1)<<DSP2_MIDDLE_G_DCOEFF_W_POS)
#define DSP2_MIDDLE_G_DCOEFF_W_UMSK                              (~(((1U<<DSP2_MIDDLE_G_DCOEFF_W_LEN)-1)<<DSP2_MIDDLE_G_DCOEFF_W_POS))
#define DSP2_MIDDLE_G_CCOEFF_W                                   DSP2_MIDDLE_G_CCOEFF_W
#define DSP2_MIDDLE_G_CCOEFF_W_POS                               (24U)
#define DSP2_MIDDLE_G_CCOEFF_W_LEN                               (8U)
#define DSP2_MIDDLE_G_CCOEFF_W_MSK                               (((1U<<DSP2_MIDDLE_G_CCOEFF_W_LEN)-1)<<DSP2_MIDDLE_G_CCOEFF_W_POS)
#define DSP2_MIDDLE_G_CCOEFF_W_UMSK                              (~(((1U<<DSP2_MIDDLE_G_CCOEFF_W_LEN)-1)<<DSP2_MIDDLE_G_CCOEFF_W_POS))

/* 0x244 : LSC_coeff_G_G */
#define DSP2_MIDDLE_LSC_COEFF_G_G_OFFSET                         (0x244)
#define DSP2_MIDDLE_G_GCOEFF_W                                   DSP2_MIDDLE_G_GCOEFF_W
#define DSP2_MIDDLE_G_GCOEFF_W_POS                               (0U)
#define DSP2_MIDDLE_G_GCOEFF_W_LEN                               (23U)
#define DSP2_MIDDLE_G_GCOEFF_W_MSK                               (((1U<<DSP2_MIDDLE_G_GCOEFF_W_LEN)-1)<<DSP2_MIDDLE_G_GCOEFF_W_POS)
#define DSP2_MIDDLE_G_GCOEFF_W_UMSK                              (~(((1U<<DSP2_MIDDLE_G_GCOEFF_W_LEN)-1)<<DSP2_MIDDLE_G_GCOEFF_W_POS))

/* 0x248 : LSC_coeff_B_A */
#define DSP2_MIDDLE_LSC_COEFF_B_A_OFFSET                         (0x248)
#define DSP2_MIDDLE_B_ACOEFF_W                                   DSP2_MIDDLE_B_ACOEFF_W
#define DSP2_MIDDLE_B_ACOEFF_W_POS                               (0U)
#define DSP2_MIDDLE_B_ACOEFF_W_LEN                               (23U)
#define DSP2_MIDDLE_B_ACOEFF_W_MSK                               (((1U<<DSP2_MIDDLE_B_ACOEFF_W_LEN)-1)<<DSP2_MIDDLE_B_ACOEFF_W_POS)
#define DSP2_MIDDLE_B_ACOEFF_W_UMSK                              (~(((1U<<DSP2_MIDDLE_B_ACOEFF_W_LEN)-1)<<DSP2_MIDDLE_B_ACOEFF_W_POS))

/* 0x24C : LSC_coeff_B_BE */
#define DSP2_MIDDLE_LSC_COEFF_B_BE_OFFSET                        (0x24C)
#define DSP2_MIDDLE_B_BCOEFF_W                                   DSP2_MIDDLE_B_BCOEFF_W
#define DSP2_MIDDLE_B_BCOEFF_W_POS                               (0U)
#define DSP2_MIDDLE_B_BCOEFF_W_LEN                               (13U)
#define DSP2_MIDDLE_B_BCOEFF_W_MSK                               (((1U<<DSP2_MIDDLE_B_BCOEFF_W_LEN)-1)<<DSP2_MIDDLE_B_BCOEFF_W_POS)
#define DSP2_MIDDLE_B_BCOEFF_W_UMSK                              (~(((1U<<DSP2_MIDDLE_B_BCOEFF_W_LEN)-1)<<DSP2_MIDDLE_B_BCOEFF_W_POS))
#define DSP2_MIDDLE_B_ECOEFF_W                                   DSP2_MIDDLE_B_ECOEFF_W
#define DSP2_MIDDLE_B_ECOEFF_W_POS                               (16U)
#define DSP2_MIDDLE_B_ECOEFF_W_LEN                               (13U)
#define DSP2_MIDDLE_B_ECOEFF_W_MSK                               (((1U<<DSP2_MIDDLE_B_ECOEFF_W_LEN)-1)<<DSP2_MIDDLE_B_ECOEFF_W_POS)
#define DSP2_MIDDLE_B_ECOEFF_W_UMSK                              (~(((1U<<DSP2_MIDDLE_B_ECOEFF_W_LEN)-1)<<DSP2_MIDDLE_B_ECOEFF_W_POS))

/* 0x250 : LSC_coeff_B_CD */
#define DSP2_MIDDLE_LSC_COEFF_B_CD_OFFSET                        (0x250)
#define DSP2_MIDDLE_B_DCOEFF_W                                   DSP2_MIDDLE_B_DCOEFF_W
#define DSP2_MIDDLE_B_DCOEFF_W_POS                               (0U)
#define DSP2_MIDDLE_B_DCOEFF_W_LEN                               (23U)
#define DSP2_MIDDLE_B_DCOEFF_W_MSK                               (((1U<<DSP2_MIDDLE_B_DCOEFF_W_LEN)-1)<<DSP2_MIDDLE_B_DCOEFF_W_POS)
#define DSP2_MIDDLE_B_DCOEFF_W_UMSK                              (~(((1U<<DSP2_MIDDLE_B_DCOEFF_W_LEN)-1)<<DSP2_MIDDLE_B_DCOEFF_W_POS))
#define DSP2_MIDDLE_B_CCOEFF_W                                   DSP2_MIDDLE_B_CCOEFF_W
#define DSP2_MIDDLE_B_CCOEFF_W_POS                               (24U)
#define DSP2_MIDDLE_B_CCOEFF_W_LEN                               (8U)
#define DSP2_MIDDLE_B_CCOEFF_W_MSK                               (((1U<<DSP2_MIDDLE_B_CCOEFF_W_LEN)-1)<<DSP2_MIDDLE_B_CCOEFF_W_POS)
#define DSP2_MIDDLE_B_CCOEFF_W_UMSK                              (~(((1U<<DSP2_MIDDLE_B_CCOEFF_W_LEN)-1)<<DSP2_MIDDLE_B_CCOEFF_W_POS))

/* 0x254 : LSC_coeff_B_G */
#define DSP2_MIDDLE_LSC_COEFF_B_G_OFFSET                         (0x254)
#define DSP2_MIDDLE_B_GCOEFF_W                                   DSP2_MIDDLE_B_GCOEFF_W
#define DSP2_MIDDLE_B_GCOEFF_W_POS                               (0U)
#define DSP2_MIDDLE_B_GCOEFF_W_LEN                               (23U)
#define DSP2_MIDDLE_B_GCOEFF_W_MSK                               (((1U<<DSP2_MIDDLE_B_GCOEFF_W_LEN)-1)<<DSP2_MIDDLE_B_GCOEFF_W_POS)
#define DSP2_MIDDLE_B_GCOEFF_W_UMSK                              (~(((1U<<DSP2_MIDDLE_B_GCOEFF_W_LEN)-1)<<DSP2_MIDDLE_B_GCOEFF_W_POS))

