sipeed/M1s_BL808_SDK/components/stage/dsp2/dsp2_drv/dsp2_reg/dsp2_middle_reg_a0.h
/* 0x258 : MAX_R_G */
#define DSP2_MIDDLE_MAX_R_G_OFFSET                               (0x258)
#define DSP2_MIDDLE_MAXR_W                                       DSP2_MIDDLE_MAXR_W
#define DSP2_MIDDLE_MAXR_W_POS                                   (0U)
#define DSP2_MIDDLE_MAXR_W_LEN                                   (16U)
#define DSP2_MIDDLE_MAXR_W_MSK                                   (((1U<<DSP2_MIDDLE_MAXR_W_LEN)-1)<<DSP2_MIDDLE_MAXR_W_POS)
#define DSP2_MIDDLE_MAXR_W_UMSK                                  (~(((1U<<DSP2_MIDDLE_MAXR_W_LEN)-1)<<DSP2_MIDDLE_MAXR_W_POS))
#define DSP2_MIDDLE_MAXG_W                                       DSP2_MIDDLE_MAXG_W
#define DSP2_MIDDLE_MAXG_W_POS                                   (16U)
#define DSP2_MIDDLE_MAXG_W_LEN                                   (16U)
#define DSP2_MIDDLE_MAXG_W_MSK                                   (((1U<<DSP2_MIDDLE_MAXG_W_LEN)-1)<<DSP2_MIDDLE_MAXG_W_POS)
#define DSP2_MIDDLE_MAXG_W_UMSK                                  (~(((1U<<DSP2_MIDDLE_MAXG_W_LEN)-1)<<DSP2_MIDDLE_MAXG_W_POS))

/* 0x25C : MAX_B */
#define DSP2_MIDDLE_MAX_B_OFFSET                                 (0x25C)
#define DSP2_MIDDLE_MAXB_W                                       DSP2_MIDDLE_MAXB_W
#define DSP2_MIDDLE_MAXB_W_POS                                   (0U)
#define DSP2_MIDDLE_MAXB_W_LEN                                   (16U)
#define DSP2_MIDDLE_MAXB_W_MSK                                   (((1U<<DSP2_MIDDLE_MAXB_W_LEN)-1)<<DSP2_MIDDLE_MAXB_W_POS)
#define DSP2_MIDDLE_MAXB_W_UMSK                                  (~(((1U<<DSP2_MIDDLE_MAXB_W_LEN)-1)<<DSP2_MIDDLE_MAXB_W_POS))

/* 0x260 : defect_setting */
#define DSP2_MIDDLE_DEFECT_SETTING_OFFSET                        (0x260)
#define DSP2_MIDDLE_DEFECT_CORRECT_MODE_W                        DSP2_MIDDLE_DEFECT_CORRECT_MODE_W
#define DSP2_MIDDLE_DEFECT_CORRECT_MODE_W_POS                    (0U)
#define DSP2_MIDDLE_DEFECT_CORRECT_MODE_W_LEN                    (3U)
#define DSP2_MIDDLE_DEFECT_CORRECT_MODE_W_MSK                    (((1U<<DSP2_MIDDLE_DEFECT_CORRECT_MODE_W_LEN)-1)<<DSP2_MIDDLE_DEFECT_CORRECT_MODE_W_POS)
#define DSP2_MIDDLE_DEFECT_CORRECT_MODE_W_UMSK                   (~(((1U<<DSP2_MIDDLE_DEFECT_CORRECT_MODE_W_LEN)-1)<<DSP2_MIDDLE_DEFECT_CORRECT_MODE_W_POS))
#define DSP2_MIDDLE_RESOLUTION_ENHANCE1_W                        DSP2_MIDDLE_RESOLUTION_ENHANCE1_W
#define DSP2_MIDDLE_RESOLUTION_ENHANCE1_W_POS                    (8U)
#define DSP2_MIDDLE_RESOLUTION_ENHANCE1_W_LEN                    (1U)
#define DSP2_MIDDLE_RESOLUTION_ENHANCE1_W_MSK                    (((1U<<DSP2_MIDDLE_RESOLUTION_ENHANCE1_W_LEN)-1)<<DSP2_MIDDLE_RESOLUTION_ENHANCE1_W_POS)
#define DSP2_MIDDLE_RESOLUTION_ENHANCE1_W_UMSK                   (~(((1U<<DSP2_MIDDLE_RESOLUTION_ENHANCE1_W_LEN)-1)<<DSP2_MIDDLE_RESOLUTION_ENHANCE1_W_POS))
#define DSP2_MIDDLE_RESOLUTION_ENHANCE2_W                        DSP2_MIDDLE_RESOLUTION_ENHANCE2_W
#define DSP2_MIDDLE_RESOLUTION_ENHANCE2_W_POS                    (9U)
#define DSP2_MIDDLE_RESOLUTION_ENHANCE2_W_LEN                    (1U)
#define DSP2_MIDDLE_RESOLUTION_ENHANCE2_W_MSK                    (((1U<<DSP2_MIDDLE_RESOLUTION_ENHANCE2_W_LEN)-1)<<DSP2_MIDDLE_RESOLUTION_ENHANCE2_W_POS)
#define DSP2_MIDDLE_RESOLUTION_ENHANCE2_W_UMSK                   (~(((1U<<DSP2_MIDDLE_RESOLUTION_ENHANCE2_W_LEN)-1)<<DSP2_MIDDLE_RESOLUTION_ENHANCE2_W_POS))
#define DSP2_MIDDLE_RESOLUTION_ENHANCE3_W                        DSP2_MIDDLE_RESOLUTION_ENHANCE3_W
#define DSP2_MIDDLE_RESOLUTION_ENHANCE3_W_POS                    (10U)
#define DSP2_MIDDLE_RESOLUTION_ENHANCE3_W_LEN                    (1U)
#define DSP2_MIDDLE_RESOLUTION_ENHANCE3_W_MSK                    (((1U<<DSP2_MIDDLE_RESOLUTION_ENHANCE3_W_LEN)-1)<<DSP2_MIDDLE_RESOLUTION_ENHANCE3_W_POS)
#define DSP2_MIDDLE_RESOLUTION_ENHANCE3_W_UMSK                   (~(((1U<<DSP2_MIDDLE_RESOLUTION_ENHANCE3_W_LEN)-1)<<DSP2_MIDDLE_RESOLUTION_ENHANCE3_W_POS))
#define DSP2_MIDDLE_DEFECT_ADDRESS_W                             DSP2_MIDDLE_DEFECT_ADDRESS_W
#define DSP2_MIDDLE_DEFECT_ADDRESS_W_POS                         (16U)
#define DSP2_MIDDLE_DEFECT_ADDRESS_W_LEN                         (8U)
#define DSP2_MIDDLE_DEFECT_ADDRESS_W_MSK                         (((1U<<DSP2_MIDDLE_DEFECT_ADDRESS_W_LEN)-1)<<DSP2_MIDDLE_DEFECT_ADDRESS_W_POS)
#define DSP2_MIDDLE_DEFECT_ADDRESS_W_UMSK                        (~(((1U<<DSP2_MIDDLE_DEFECT_ADDRESS_W_LEN)-1)<<DSP2_MIDDLE_DEFECT_ADDRESS_W_POS))

/* 0x264 : defect_position */
#define DSP2_MIDDLE_DEFECT_POSITION_OFFSET                       (0x264)
#define DSP2_MIDDLE_X_POSITION_W                                 DSP2_MIDDLE_X_POSITION_W
#define DSP2_MIDDLE_X_POSITION_W_POS                             (0U)
#define DSP2_MIDDLE_X_POSITION_W_LEN                             (16U)
#define DSP2_MIDDLE_X_POSITION_W_MSK                             (((1U<<DSP2_MIDDLE_X_POSITION_W_LEN)-1)<<DSP2_MIDDLE_X_POSITION_W_POS)
#define DSP2_MIDDLE_X_POSITION_W_UMSK                            (~(((1U<<DSP2_MIDDLE_X_POSITION_W_LEN)-1)<<DSP2_MIDDLE_X_POSITION_W_POS))
#define DSP2_MIDDLE_Y_POSITION_W                                 DSP2_MIDDLE_Y_POSITION_W
#define DSP2_MIDDLE_Y_POSITION_W_POS                             (16U)
#define DSP2_MIDDLE_Y_POSITION_W_LEN                             (16U)
#define DSP2_MIDDLE_Y_POSITION_W_MSK                             (((1U<<DSP2_MIDDLE_Y_POSITION_W_LEN)-1)<<DSP2_MIDDLE_Y_POSITION_W_POS)
#define DSP2_MIDDLE_Y_POSITION_W_UMSK                            (~(((1U<<DSP2_MIDDLE_Y_POSITION_W_LEN)-1)<<DSP2_MIDDLE_Y_POSITION_W_POS))

/* 0x268 : defect_th_A */
#define DSP2_MIDDLE_DEFECT_TH_A_OFFSET                           (0x268)
#define DSP2_MIDDLE_DEFECT_TH1_W                                 DSP2_MIDDLE_DEFECT_TH1_W
#define DSP2_MIDDLE_DEFECT_TH1_W_POS                             (0U)
#define DSP2_MIDDLE_DEFECT_TH1_W_LEN                             (8U)
#define DSP2_MIDDLE_DEFECT_TH1_W_MSK                             (((1U<<DSP2_MIDDLE_DEFECT_TH1_W_LEN)-1)<<DSP2_MIDDLE_DEFECT_TH1_W_POS)
#define DSP2_MIDDLE_DEFECT_TH1_W_UMSK                            (~(((1U<<DSP2_MIDDLE_DEFECT_TH1_W_LEN)-1)<<DSP2_MIDDLE_DEFECT_TH1_W_POS))
#define DSP2_MIDDLE_DEFECT_TH2_W                                 DSP2_MIDDLE_DEFECT_TH2_W
#define DSP2_MIDDLE_DEFECT_TH2_W_POS                             (8U)
#define DSP2_MIDDLE_DEFECT_TH2_W_LEN                             (8U)
#define DSP2_MIDDLE_DEFECT_TH2_W_MSK                             (((1U<<DSP2_MIDDLE_DEFECT_TH2_W_LEN)-1)<<DSP2_MIDDLE_DEFECT_TH2_W_POS)
#define DSP2_MIDDLE_DEFECT_TH2_W_UMSK                            (~(((1U<<DSP2_MIDDLE_DEFECT_TH2_W_LEN)-1)<<DSP2_MIDDLE_DEFECT_TH2_W_POS))
#define DSP2_MIDDLE_DEFECT_TH3_W                                 DSP2_MIDDLE_DEFECT_TH3_W
#define DSP2_MIDDLE_DEFECT_TH3_W_POS                             (16U)
#define DSP2_MIDDLE_DEFECT_TH3_W_LEN                             (8U)
#define DSP2_MIDDLE_DEFECT_TH3_W_MSK                             (((1U<<DSP2_MIDDLE_DEFECT_TH3_W_LEN)-1)<<DSP2_MIDDLE_DEFECT_TH3_W_POS)
#define DSP2_MIDDLE_DEFECT_TH3_W_UMSK                            (~(((1U<<DSP2_MIDDLE_DEFECT_TH3_W_LEN)-1)<<DSP2_MIDDLE_DEFECT_TH3_W_POS))
#define DSP2_MIDDLE_DEFECT_TH4_W                                 DSP2_MIDDLE_DEFECT_TH4_W
#define DSP2_MIDDLE_DEFECT_TH4_W_POS                             (24U)
#define DSP2_MIDDLE_DEFECT_TH4_W_LEN                             (8U)
#define DSP2_MIDDLE_DEFECT_TH4_W_MSK                             (((1U<<DSP2_MIDDLE_DEFECT_TH4_W_LEN)-1)<<DSP2_MIDDLE_DEFECT_TH4_W_POS)
#define DSP2_MIDDLE_DEFECT_TH4_W_UMSK                            (~(((1U<<DSP2_MIDDLE_DEFECT_TH4_W_LEN)-1)<<DSP2_MIDDLE_DEFECT_TH4_W_POS))

/* 0x26C : defect_th_B */
#define DSP2_MIDDLE_DEFECT_TH_B_OFFSET                           (0x26C)
#define DSP2_MIDDLE_DEFECT_TH5_W                                 DSP2_MIDDLE_DEFECT_TH5_W
#define DSP2_MIDDLE_DEFECT_TH5_W_POS                             (0U)
#define DSP2_MIDDLE_DEFECT_TH5_W_LEN                             (8U)
#define DSP2_MIDDLE_DEFECT_TH5_W_MSK                             (((1U<<DSP2_MIDDLE_DEFECT_TH5_W_LEN)-1)<<DSP2_MIDDLE_DEFECT_TH5_W_POS)
#define DSP2_MIDDLE_DEFECT_TH5_W_UMSK                            (~(((1U<<DSP2_MIDDLE_DEFECT_TH5_W_LEN)-1)<<DSP2_MIDDLE_DEFECT_TH5_W_POS))

/* 0x270 : awb_setting */
#define DSP2_MIDDLE_AWB_SETTING_OFFSET                           (0x270)
#define DSP2_MIDDLE_AWB_SWITCH_BANK_EN_W                         DSP2_MIDDLE_AWB_SWITCH_BANK_EN_W
#define DSP2_MIDDLE_AWB_SWITCH_BANK_EN_W_POS                     (0U)
#define DSP2_MIDDLE_AWB_SWITCH_BANK_EN_W_LEN                     (1U)
#define DSP2_MIDDLE_AWB_SWITCH_BANK_EN_W_MSK                     (((1U<<DSP2_MIDDLE_AWB_SWITCH_BANK_EN_W_LEN)-1)<<DSP2_MIDDLE_AWB_SWITCH_BANK_EN_W_POS)
#define DSP2_MIDDLE_AWB_SWITCH_BANK_EN_W_UMSK                    (~(((1U<<DSP2_MIDDLE_AWB_SWITCH_BANK_EN_W_LEN)-1)<<DSP2_MIDDLE_AWB_SWITCH_BANK_EN_W_POS))
#define DSP2_MIDDLE_NEW_AWB_STA_ENABLE_W                         DSP2_MIDDLE_NEW_AWB_STA_ENABLE_W
#define DSP2_MIDDLE_NEW_AWB_STA_ENABLE_W_POS                     (1U)
#define DSP2_MIDDLE_NEW_AWB_STA_ENABLE_W_LEN                     (1U)
#define DSP2_MIDDLE_NEW_AWB_STA_ENABLE_W_MSK                     (((1U<<DSP2_MIDDLE_NEW_AWB_STA_ENABLE_W_LEN)-1)<<DSP2_MIDDLE_NEW_AWB_STA_ENABLE_W_POS)
#define DSP2_MIDDLE_NEW_AWB_STA_ENABLE_W_UMSK                    (~(((1U<<DSP2_MIDDLE_NEW_AWB_STA_ENABLE_W_LEN)-1)<<DSP2_MIDDLE_NEW_AWB_STA_ENABLE_W_POS))
#define DSP2_MIDDLE_BL_AWB_GAIN_SEL_W                            DSP2_MIDDLE_BL_AWB_GAIN_SEL_W
#define DSP2_MIDDLE_BL_AWB_GAIN_SEL_W_POS                        (2U)
#define DSP2_MIDDLE_BL_AWB_GAIN_SEL_W_LEN                        (1U)
#define DSP2_MIDDLE_BL_AWB_GAIN_SEL_W_MSK                        (((1U<<DSP2_MIDDLE_BL_AWB_GAIN_SEL_W_LEN)-1)<<DSP2_MIDDLE_BL_AWB_GAIN_SEL_W_POS)
#define DSP2_MIDDLE_BL_AWB_GAIN_SEL_W_UMSK                       (~(((1U<<DSP2_MIDDLE_BL_AWB_GAIN_SEL_W_LEN)-1)<<DSP2_MIDDLE_BL_AWB_GAIN_SEL_W_POS))
#define DSP2_MIDDLE_GRID_CNT_WITHIN_THRE_R                       DSP2_MIDDLE_GRID_CNT_WITHIN_THRE_R
#define DSP2_MIDDLE_GRID_CNT_WITHIN_THRE_R_POS                   (16U)
#define DSP2_MIDDLE_GRID_CNT_WITHIN_THRE_R_LEN                   (11U)
#define DSP2_MIDDLE_GRID_CNT_WITHIN_THRE_R_MSK                   (((1U<<DSP2_MIDDLE_GRID_CNT_WITHIN_THRE_R_LEN)-1)<<DSP2_MIDDLE_GRID_CNT_WITHIN_THRE_R_POS)
#define DSP2_MIDDLE_GRID_CNT_WITHIN_THRE_R_UMSK                  (~(((1U<<DSP2_MIDDLE_GRID_CNT_WITHIN_THRE_R_LEN)-1)<<DSP2_MIDDLE_GRID_CNT_WITHIN_THRE_R_POS))

/* 0x274 : awb_roi_x */
#define DSP2_MIDDLE_AWB_ROI_X_OFFSET                             (0x274)
#define DSP2_MIDDLE_AWB_ROI_START_X_W                            DSP2_MIDDLE_AWB_ROI_START_X_W
#define DSP2_MIDDLE_AWB_ROI_START_X_W_POS                        (0U)
#define DSP2_MIDDLE_AWB_ROI_START_X_W_LEN                        (11U)
#define DSP2_MIDDLE_AWB_ROI_START_X_W_MSK                        (((1U<<DSP2_MIDDLE_AWB_ROI_START_X_W_LEN)-1)<<DSP2_MIDDLE_AWB_ROI_START_X_W_POS)
#define DSP2_MIDDLE_AWB_ROI_START_X_W_UMSK                       (~(((1U<<DSP2_MIDDLE_AWB_ROI_START_X_W_LEN)-1)<<DSP2_MIDDLE_AWB_ROI_START_X_W_POS))
#define DSP2_MIDDLE_AWB_ROI_WIDTH_W                              DSP2_MIDDLE_AWB_ROI_WIDTH_W
#define DSP2_MIDDLE_AWB_ROI_WIDTH_W_POS                          (16U)
#define DSP2_MIDDLE_AWB_ROI_WIDTH_W_LEN                          (11U)
#define DSP2_MIDDLE_AWB_ROI_WIDTH_W_MSK                          (((1U<<DSP2_MIDDLE_AWB_ROI_WIDTH_W_LEN)-1)<<DSP2_MIDDLE_AWB_ROI_WIDTH_W_POS)
#define DSP2_MIDDLE_AWB_ROI_WIDTH_W_UMSK                         (~(((1U<<DSP2_MIDDLE_AWB_ROI_WIDTH_W_LEN)-1)<<DSP2_MIDDLE_AWB_ROI_WIDTH_W_POS))

/* 0x278 : awb_roi_y */
#define DSP2_MIDDLE_AWB_ROI_Y_OFFSET                             (0x278)
#define DSP2_MIDDLE_AWB_ROI_START_Y_W                            DSP2_MIDDLE_AWB_ROI_START_Y_W
#define DSP2_MIDDLE_AWB_ROI_START_Y_W_POS                        (0U)
#define DSP2_MIDDLE_AWB_ROI_START_Y_W_LEN                        (11U)
#define DSP2_MIDDLE_AWB_ROI_START_Y_W_MSK                        (((1U<<DSP2_MIDDLE_AWB_ROI_START_Y_W_LEN)-1)<<DSP2_MIDDLE_AWB_ROI_START_Y_W_POS)
#define DSP2_MIDDLE_AWB_ROI_START_Y_W_UMSK                       (~(((1U<<DSP2_MIDDLE_AWB_ROI_START_Y_W_LEN)-1)<<DSP2_MIDDLE_AWB_ROI_START_Y_W_POS))
#define DSP2_MIDDLE_AWB_ROI_HEIGHT_W                             DSP2_MIDDLE_AWB_ROI_HEIGHT_W
#define DSP2_MIDDLE_AWB_ROI_HEIGHT_W_POS                         (16U)
#define DSP2_MIDDLE_AWB_ROI_HEIGHT_W_LEN                         (11U)
#define DSP2_MIDDLE_AWB_ROI_HEIGHT_W_MSK                         (((1U<<DSP2_MIDDLE_AWB_ROI_HEIGHT_W_LEN)-1)<<DSP2_MIDDLE_AWB_ROI_HEIGHT_W_POS)
#define DSP2_MIDDLE_AWB_ROI_HEIGHT_W_UMSK                        (~(((1U<<DSP2_MIDDLE_AWB_ROI_HEIGHT_W_LEN)-1)<<DSP2_MIDDLE_AWB_ROI_HEIGHT_W_POS))

/* 0x27C : awb_image_size */
#define DSP2_MIDDLE_AWB_IMAGE_SIZE_OFFSET                        (0x27C)
#define DSP2_MIDDLE_AWB_IMAGE_WIDTH_W                            DSP2_MIDDLE_AWB_IMAGE_WIDTH_W
#define DSP2_MIDDLE_AWB_IMAGE_WIDTH_W_POS                        (0U)
#define DSP2_MIDDLE_AWB_IMAGE_WIDTH_W_LEN                        (11U)
#define DSP2_MIDDLE_AWB_IMAGE_WIDTH_W_MSK                        (((1U<<DSP2_MIDDLE_AWB_IMAGE_WIDTH_W_LEN)-1)<<DSP2_MIDDLE_AWB_IMAGE_WIDTH_W_POS)
#define DSP2_MIDDLE_AWB_IMAGE_WIDTH_W_UMSK                       (~(((1U<<DSP2_MIDDLE_AWB_IMAGE_WIDTH_W_LEN)-1)<<DSP2_MIDDLE_AWB_IMAGE_WIDTH_W_POS))
#define DSP2_MIDDLE_AWB_IMAGE_HEIGHT_W                           DSP2_MIDDLE_AWB_IMAGE_HEIGHT_W
#define DSP2_MIDDLE_AWB_IMAGE_HEIGHT_W_POS                       (16U)
#define DSP2_MIDDLE_AWB_IMAGE_HEIGHT_W_LEN                       (11U)
#define DSP2_MIDDLE_AWB_IMAGE_HEIGHT_W_MSK                       (((1U<<DSP2_MIDDLE_AWB_IMAGE_HEIGHT_W_LEN)-1)<<DSP2_MIDDLE_AWB_IMAGE_HEIGHT_W_POS)
#define DSP2_MIDDLE_AWB_IMAGE_HEIGHT_W_UMSK                      (~(((1U<<DSP2_MIDDLE_AWB_IMAGE_HEIGHT_W_LEN)-1)<<DSP2_MIDDLE_AWB_IMAGE_HEIGHT_W_POS))

/* 0x280 : awb_grid_size */
#define DSP2_MIDDLE_AWB_GRID_SIZE_OFFSET                         (0x280)
#define DSP2_MIDDLE_AWB_GRID_WIDTH_W                             DSP2_MIDDLE_AWB_GRID_WIDTH_W
#define DSP2_MIDDLE_AWB_GRID_WIDTH_W_POS                         (0U)
#define DSP2_MIDDLE_AWB_GRID_WIDTH_W_LEN                         (8U)
#define DSP2_MIDDLE_AWB_GRID_WIDTH_W_MSK                         (((1U<<DSP2_MIDDLE_AWB_GRID_WIDTH_W_LEN)-1)<<DSP2_MIDDLE_AWB_GRID_WIDTH_W_POS)
#define DSP2_MIDDLE_AWB_GRID_WIDTH_W_UMSK                        (~(((1U<<DSP2_MIDDLE_AWB_GRID_WIDTH_W_LEN)-1)<<DSP2_MIDDLE_AWB_GRID_WIDTH_W_POS))
#define DSP2_MIDDLE_AWB_GRID_HEIGHT_W                            DSP2_MIDDLE_AWB_GRID_HEIGHT_W
#define DSP2_MIDDLE_AWB_GRID_HEIGHT_W_POS                        (8U)
#define DSP2_MIDDLE_AWB_GRID_HEIGHT_W_LEN                        (8U)
#define DSP2_MIDDLE_AWB_GRID_HEIGHT_W_MSK                        (((1U<<DSP2_MIDDLE_AWB_GRID_HEIGHT_W_LEN)-1)<<DSP2_MIDDLE_AWB_GRID_HEIGHT_W_POS)
#define DSP2_MIDDLE_AWB_GRID_HEIGHT_W_UMSK                       (~(((1U<<DSP2_MIDDLE_AWB_GRID_HEIGHT_W_LEN)-1)<<DSP2_MIDDLE_AWB_GRID_HEIGHT_W_POS))
#define DSP2_MIDDLE_AWB_GRID_X_MAX_W                             DSP2_MIDDLE_AWB_GRID_X_MAX_W
#define DSP2_MIDDLE_AWB_GRID_X_MAX_W_POS                         (16U)
#define DSP2_MIDDLE_AWB_GRID_X_MAX_W_LEN                         (6U)
#define DSP2_MIDDLE_AWB_GRID_X_MAX_W_MSK                         (((1U<<DSP2_MIDDLE_AWB_GRID_X_MAX_W_LEN)-1)<<DSP2_MIDDLE_AWB_GRID_X_MAX_W_POS)
#define DSP2_MIDDLE_AWB_GRID_X_MAX_W_UMSK                        (~(((1U<<DSP2_MIDDLE_AWB_GRID_X_MAX_W_LEN)-1)<<DSP2_MIDDLE_AWB_GRID_X_MAX_W_POS))
#define DSP2_MIDDLE_AWB_GRID_Y_MAX_W                             DSP2_MIDDLE_AWB_GRID_Y_MAX_W
#define DSP2_MIDDLE_AWB_GRID_Y_MAX_W_POS                         (24U)
#define DSP2_MIDDLE_AWB_GRID_Y_MAX_W_LEN                         (6U)
#define DSP2_MIDDLE_AWB_GRID_Y_MAX_W_MSK                         (((1U<<DSP2_MIDDLE_AWB_GRID_Y_MAX_W_LEN)-1)<<DSP2_MIDDLE_AWB_GRID_Y_MAX_W_POS)
#define DSP2_MIDDLE_AWB_GRID_Y_MAX_W_UMSK                        (~(((1U<<DSP2_MIDDLE_AWB_GRID_Y_MAX_W_LEN)-1)<<DSP2_MIDDLE_AWB_GRID_Y_MAX_W_POS))

/* 0x284 : awb_r_thre */
#define DSP2_MIDDLE_AWB_R_THRE_OFFSET                            (0x284)
#define DSP2_MIDDLE_AWB_R_MAX_THR_W                              DSP2_MIDDLE_AWB_R_MAX_THR_W
#define DSP2_MIDDLE_AWB_R_MAX_THR_W_POS                          (0U)
#define DSP2_MIDDLE_AWB_R_MAX_THR_W_LEN                          (12U)
#define DSP2_MIDDLE_AWB_R_MAX_THR_W_MSK                          (((1U<<DSP2_MIDDLE_AWB_R_MAX_THR_W_LEN)-1)<<DSP2_MIDDLE_AWB_R_MAX_THR_W_POS)
#define DSP2_MIDDLE_AWB_R_MAX_THR_W_UMSK                         (~(((1U<<DSP2_MIDDLE_AWB_R_MAX_THR_W_LEN)-1)<<DSP2_MIDDLE_AWB_R_MAX_THR_W_POS))
#define DSP2_MIDDLE_AWB_R_MIN_THR_W                              DSP2_MIDDLE_AWB_R_MIN_THR_W
#define DSP2_MIDDLE_AWB_R_MIN_THR_W_POS                          (16U)
#define DSP2_MIDDLE_AWB_R_MIN_THR_W_LEN                          (12U)
#define DSP2_MIDDLE_AWB_R_MIN_THR_W_MSK                          (((1U<<DSP2_MIDDLE_AWB_R_MIN_THR_W_LEN)-1)<<DSP2_MIDDLE_AWB_R_MIN_THR_W_POS)
#define DSP2_MIDDLE_AWB_R_MIN_THR_W_UMSK                         (~(((1U<<DSP2_MIDDLE_AWB_R_MIN_THR_W_LEN)-1)<<DSP2_MIDDLE_AWB_R_MIN_THR_W_POS))

/* 0x288 : awb_g_thre */
#define DSP2_MIDDLE_AWB_G_THRE_OFFSET                            (0x288)
#define DSP2_MIDDLE_AWB_G_MAX_THR_W                              DSP2_MIDDLE_AWB_G_MAX_THR_W
#define DSP2_MIDDLE_AWB_G_MAX_THR_W_POS                          (0U)
#define DSP2_MIDDLE_AWB_G_MAX_THR_W_LEN                          (12U)
#define DSP2_MIDDLE_AWB_G_MAX_THR_W_MSK                          (((1U<<DSP2_MIDDLE_AWB_G_MAX_THR_W_LEN)-1)<<DSP2_MIDDLE_AWB_G_MAX_THR_W_POS)
#define DSP2_MIDDLE_AWB_G_MAX_THR_W_UMSK                         (~(((1U<<DSP2_MIDDLE_AWB_G_MAX_THR_W_LEN)-1)<<DSP2_MIDDLE_AWB_G_MAX_THR_W_POS))
#define DSP2_MIDDLE_AWB_G_MIN_THR_W                              DSP2_MIDDLE_AWB_G_MIN_THR_W
#define DSP2_MIDDLE_AWB_G_MIN_THR_W_POS                          (16U)
#define DSP2_MIDDLE_AWB_G_MIN_THR_W_LEN                          (12U)
#define DSP2_MIDDLE_AWB_G_MIN_THR_W_MSK                          (((1U<<DSP2_MIDDLE_AWB_G_MIN_THR_W_LEN)-1)<<DSP2_MIDDLE_AWB_G_MIN_THR_W_POS)
#define DSP2_MIDDLE_AWB_G_MIN_THR_W_UMSK                         (~(((1U<<DSP2_MIDDLE_AWB_G_MIN_THR_W_LEN)-1)<<DSP2_MIDDLE_AWB_G_MIN_THR_W_POS))

