sipeed/M1s_BL808_SDK/components/stage/dsp2/dsp2_drv/dsp2_reg/dsp2_middle_reg_a0.h
/* 0x28C : awb_b_thre */
#define DSP2_MIDDLE_AWB_B_THRE_OFFSET                            (0x28C)
#define DSP2_MIDDLE_AWB_B_MAX_THR_W                              DSP2_MIDDLE_AWB_B_MAX_THR_W
#define DSP2_MIDDLE_AWB_B_MAX_THR_W_POS                          (0U)
#define DSP2_MIDDLE_AWB_B_MAX_THR_W_LEN                          (12U)
#define DSP2_MIDDLE_AWB_B_MAX_THR_W_MSK                          (((1U<<DSP2_MIDDLE_AWB_B_MAX_THR_W_LEN)-1)<<DSP2_MIDDLE_AWB_B_MAX_THR_W_POS)
#define DSP2_MIDDLE_AWB_B_MAX_THR_W_UMSK                         (~(((1U<<DSP2_MIDDLE_AWB_B_MAX_THR_W_LEN)-1)<<DSP2_MIDDLE_AWB_B_MAX_THR_W_POS))
#define DSP2_MIDDLE_AWB_B_MIN_THR_W                              DSP2_MIDDLE_AWB_B_MIN_THR_W
#define DSP2_MIDDLE_AWB_B_MIN_THR_W_POS                          (16U)
#define DSP2_MIDDLE_AWB_B_MIN_THR_W_LEN                          (12U)
#define DSP2_MIDDLE_AWB_B_MIN_THR_W_MSK                          (((1U<<DSP2_MIDDLE_AWB_B_MIN_THR_W_LEN)-1)<<DSP2_MIDDLE_AWB_B_MIN_THR_W_POS)
#define DSP2_MIDDLE_AWB_B_MIN_THR_W_UMSK                         (~(((1U<<DSP2_MIDDLE_AWB_B_MIN_THR_W_LEN)-1)<<DSP2_MIDDLE_AWB_B_MIN_THR_W_POS))

/* 0x290 : awb_rgr_gain */
#define DSP2_MIDDLE_AWB_RGR_GAIN_OFFSET                          (0x290)
#define DSP2_MIDDLE_AWB_GR_GAIN_PRE                              DSP2_MIDDLE_AWB_GR_GAIN_PRE
#define DSP2_MIDDLE_AWB_GR_GAIN_PRE_POS                          (0U)
#define DSP2_MIDDLE_AWB_GR_GAIN_PRE_LEN                          (15U)
#define DSP2_MIDDLE_AWB_GR_GAIN_PRE_MSK                          (((1U<<DSP2_MIDDLE_AWB_GR_GAIN_PRE_LEN)-1)<<DSP2_MIDDLE_AWB_GR_GAIN_PRE_POS)
#define DSP2_MIDDLE_AWB_GR_GAIN_PRE_UMSK                         (~(((1U<<DSP2_MIDDLE_AWB_GR_GAIN_PRE_LEN)-1)<<DSP2_MIDDLE_AWB_GR_GAIN_PRE_POS))
#define DSP2_MIDDLE_AWB_R_GAIN_PRE                               DSP2_MIDDLE_AWB_R_GAIN_PRE
#define DSP2_MIDDLE_AWB_R_GAIN_PRE_POS                           (16U)
#define DSP2_MIDDLE_AWB_R_GAIN_PRE_LEN                           (15U)
#define DSP2_MIDDLE_AWB_R_GAIN_PRE_MSK                           (((1U<<DSP2_MIDDLE_AWB_R_GAIN_PRE_LEN)-1)<<DSP2_MIDDLE_AWB_R_GAIN_PRE_POS)
#define DSP2_MIDDLE_AWB_R_GAIN_PRE_UMSK                          (~(((1U<<DSP2_MIDDLE_AWB_R_GAIN_PRE_LEN)-1)<<DSP2_MIDDLE_AWB_R_GAIN_PRE_POS))

/* 0x294 : awb_bgb_gain */
#define DSP2_MIDDLE_AWB_BGB_GAIN_OFFSET                          (0x294)
#define DSP2_MIDDLE_AWB_GB_GAIN_PRE                              DSP2_MIDDLE_AWB_GB_GAIN_PRE
#define DSP2_MIDDLE_AWB_GB_GAIN_PRE_POS                          (0U)
#define DSP2_MIDDLE_AWB_GB_GAIN_PRE_LEN                          (15U)
#define DSP2_MIDDLE_AWB_GB_GAIN_PRE_MSK                          (((1U<<DSP2_MIDDLE_AWB_GB_GAIN_PRE_LEN)-1)<<DSP2_MIDDLE_AWB_GB_GAIN_PRE_POS)
#define DSP2_MIDDLE_AWB_GB_GAIN_PRE_UMSK                         (~(((1U<<DSP2_MIDDLE_AWB_GB_GAIN_PRE_LEN)-1)<<DSP2_MIDDLE_AWB_GB_GAIN_PRE_POS))
#define DSP2_MIDDLE_AWB_B_GAIN_PRE                               DSP2_MIDDLE_AWB_B_GAIN_PRE
#define DSP2_MIDDLE_AWB_B_GAIN_PRE_POS                           (16U)
#define DSP2_MIDDLE_AWB_B_GAIN_PRE_LEN                           (15U)
#define DSP2_MIDDLE_AWB_B_GAIN_PRE_MSK                           (((1U<<DSP2_MIDDLE_AWB_B_GAIN_PRE_LEN)-1)<<DSP2_MIDDLE_AWB_B_GAIN_PRE_POS)
#define DSP2_MIDDLE_AWB_B_GAIN_PRE_UMSK                          (~(((1U<<DSP2_MIDDLE_AWB_B_GAIN_PRE_LEN)-1)<<DSP2_MIDDLE_AWB_B_GAIN_PRE_POS))

/* 0x2A0 : cfa_int_1 */
#define DSP2_MIDDLE_CFA_INT_1_OFFSET                             (0x2A0)
#define DSP2_MIDDLE_REG_CFA_FRINGE_ON_W                          DSP2_MIDDLE_REG_CFA_FRINGE_ON_W
#define DSP2_MIDDLE_REG_CFA_FRINGE_ON_W_POS                      (0U)
#define DSP2_MIDDLE_REG_CFA_FRINGE_ON_W_LEN                      (1U)
#define DSP2_MIDDLE_REG_CFA_FRINGE_ON_W_MSK                      (((1U<<DSP2_MIDDLE_REG_CFA_FRINGE_ON_W_LEN)-1)<<DSP2_MIDDLE_REG_CFA_FRINGE_ON_W_POS)
#define DSP2_MIDDLE_REG_CFA_FRINGE_ON_W_UMSK                     (~(((1U<<DSP2_MIDDLE_REG_CFA_FRINGE_ON_W_LEN)-1)<<DSP2_MIDDLE_REG_CFA_FRINGE_ON_W_POS))

/* 0x2F4 : awb_sta_dbg1 */
#define DSP2_MIDDLE_AWB_STA_DBG1_OFFSET                          (0x2F4)
#define DSP2_MIDDLE_AWB_GRID_CNT_MAX                             DSP2_MIDDLE_AWB_GRID_CNT_MAX
#define DSP2_MIDDLE_AWB_GRID_CNT_MAX_POS                         (0U)
#define DSP2_MIDDLE_AWB_GRID_CNT_MAX_LEN                         (11U)
#define DSP2_MIDDLE_AWB_GRID_CNT_MAX_MSK                         (((1U<<DSP2_MIDDLE_AWB_GRID_CNT_MAX_LEN)-1)<<DSP2_MIDDLE_AWB_GRID_CNT_MAX_POS)
#define DSP2_MIDDLE_AWB_GRID_CNT_MAX_UMSK                        (~(((1U<<DSP2_MIDDLE_AWB_GRID_CNT_MAX_LEN)-1)<<DSP2_MIDDLE_AWB_GRID_CNT_MAX_POS))
#define DSP2_MIDDLE_AWB_FIFO_FULL                                DSP2_MIDDLE_AWB_FIFO_FULL
#define DSP2_MIDDLE_AWB_FIFO_FULL_POS                            (12U)
#define DSP2_MIDDLE_AWB_FIFO_FULL_LEN                            (1U)
#define DSP2_MIDDLE_AWB_FIFO_FULL_MSK                            (((1U<<DSP2_MIDDLE_AWB_FIFO_FULL_LEN)-1)<<DSP2_MIDDLE_AWB_FIFO_FULL_POS)
#define DSP2_MIDDLE_AWB_FIFO_FULL_UMSK                           (~(((1U<<DSP2_MIDDLE_AWB_FIFO_FULL_LEN)-1)<<DSP2_MIDDLE_AWB_FIFO_FULL_POS))
#define DSP2_MIDDLE_AWB_CONTROL_STATUS                           DSP2_MIDDLE_AWB_CONTROL_STATUS
#define DSP2_MIDDLE_AWB_CONTROL_STATUS_POS                       (16U)
#define DSP2_MIDDLE_AWB_CONTROL_STATUS_LEN                       (4U)
#define DSP2_MIDDLE_AWB_CONTROL_STATUS_MSK                       (((1U<<DSP2_MIDDLE_AWB_CONTROL_STATUS_LEN)-1)<<DSP2_MIDDLE_AWB_CONTROL_STATUS_POS)
#define DSP2_MIDDLE_AWB_CONTROL_STATUS_UMSK                      (~(((1U<<DSP2_MIDDLE_AWB_CONTROL_STATUS_LEN)-1)<<DSP2_MIDDLE_AWB_CONTROL_STATUS_POS))
#define DSP2_MIDDLE_AWB_OPERATION_DONE                           DSP2_MIDDLE_AWB_OPERATION_DONE
#define DSP2_MIDDLE_AWB_OPERATION_DONE_POS                       (20U)
#define DSP2_MIDDLE_AWB_OPERATION_DONE_LEN                       (1U)
#define DSP2_MIDDLE_AWB_OPERATION_DONE_MSK                       (((1U<<DSP2_MIDDLE_AWB_OPERATION_DONE_LEN)-1)<<DSP2_MIDDLE_AWB_OPERATION_DONE_POS)
#define DSP2_MIDDLE_AWB_OPERATION_DONE_UMSK                      (~(((1U<<DSP2_MIDDLE_AWB_OPERATION_DONE_LEN)-1)<<DSP2_MIDDLE_AWB_OPERATION_DONE_POS))
#define DSP2_MIDDLE_AWB_FIFO_EMPTY                               DSP2_MIDDLE_AWB_FIFO_EMPTY
#define DSP2_MIDDLE_AWB_FIFO_EMPTY_POS                           (21U)
#define DSP2_MIDDLE_AWB_FIFO_EMPTY_LEN                           (1U)
#define DSP2_MIDDLE_AWB_FIFO_EMPTY_MSK                           (((1U<<DSP2_MIDDLE_AWB_FIFO_EMPTY_LEN)-1)<<DSP2_MIDDLE_AWB_FIFO_EMPTY_POS)
#define DSP2_MIDDLE_AWB_FIFO_EMPTY_UMSK                          (~(((1U<<DSP2_MIDDLE_AWB_FIFO_EMPTY_LEN)-1)<<DSP2_MIDDLE_AWB_FIFO_EMPTY_POS))
#define DSP2_MIDDLE_BLAWB_W_CNT_R                                DSP2_MIDDLE_BLAWB_W_CNT_R
#define DSP2_MIDDLE_BLAWB_W_CNT_R_POS                            (24U)
#define DSP2_MIDDLE_BLAWB_W_CNT_R_LEN                            (5U)
#define DSP2_MIDDLE_BLAWB_W_CNT_R_MSK                            (((1U<<DSP2_MIDDLE_BLAWB_W_CNT_R_LEN)-1)<<DSP2_MIDDLE_BLAWB_W_CNT_R_POS)
#define DSP2_MIDDLE_BLAWB_W_CNT_R_UMSK                           (~(((1U<<DSP2_MIDDLE_BLAWB_W_CNT_R_LEN)-1)<<DSP2_MIDDLE_BLAWB_W_CNT_R_POS))
#define DSP2_MIDDLE_BLAWB_BUF_IDX_R                              DSP2_MIDDLE_BLAWB_BUF_IDX_R
#define DSP2_MIDDLE_BLAWB_BUF_IDX_R_POS                          (31U)
#define DSP2_MIDDLE_BLAWB_BUF_IDX_R_LEN                          (1U)
#define DSP2_MIDDLE_BLAWB_BUF_IDX_R_MSK                          (((1U<<DSP2_MIDDLE_BLAWB_BUF_IDX_R_LEN)-1)<<DSP2_MIDDLE_BLAWB_BUF_IDX_R_POS)
#define DSP2_MIDDLE_BLAWB_BUF_IDX_R_UMSK                         (~(((1U<<DSP2_MIDDLE_BLAWB_BUF_IDX_R_LEN)-1)<<DSP2_MIDDLE_BLAWB_BUF_IDX_R_POS))

/* 0x2F8 : awb_sta_dbg0 */
#define DSP2_MIDDLE_AWB_STA_DBG0_OFFSET                          (0x2F8)
#define DSP2_MIDDLE_AWB_GRID_CNT                                 DSP2_MIDDLE_AWB_GRID_CNT
#define DSP2_MIDDLE_AWB_GRID_CNT_POS                             (0U)
#define DSP2_MIDDLE_AWB_GRID_CNT_LEN                             (10U)
#define DSP2_MIDDLE_AWB_GRID_CNT_MSK                             (((1U<<DSP2_MIDDLE_AWB_GRID_CNT_LEN)-1)<<DSP2_MIDDLE_AWB_GRID_CNT_POS)
#define DSP2_MIDDLE_AWB_GRID_CNT_UMSK                            (~(((1U<<DSP2_MIDDLE_AWB_GRID_CNT_LEN)-1)<<DSP2_MIDDLE_AWB_GRID_CNT_POS))
#define DSP2_MIDDLE_AWB_STA_DONE                                 DSP2_MIDDLE_AWB_STA_DONE
#define DSP2_MIDDLE_AWB_STA_DONE_POS                             (12U)
#define DSP2_MIDDLE_AWB_STA_DONE_LEN                             (1U)
#define DSP2_MIDDLE_AWB_STA_DONE_MSK                             (((1U<<DSP2_MIDDLE_AWB_STA_DONE_LEN)-1)<<DSP2_MIDDLE_AWB_STA_DONE_POS)
#define DSP2_MIDDLE_AWB_STA_DONE_UMSK                            (~(((1U<<DSP2_MIDDLE_AWB_STA_DONE_LEN)-1)<<DSP2_MIDDLE_AWB_STA_DONE_POS))
#define DSP2_MIDDLE_AWB_WRITE_DATA_CNT                           DSP2_MIDDLE_AWB_WRITE_DATA_CNT
#define DSP2_MIDDLE_AWB_WRITE_DATA_CNT_POS                       (16U)
#define DSP2_MIDDLE_AWB_WRITE_DATA_CNT_LEN                       (12U)
#define DSP2_MIDDLE_AWB_WRITE_DATA_CNT_MSK                       (((1U<<DSP2_MIDDLE_AWB_WRITE_DATA_CNT_LEN)-1)<<DSP2_MIDDLE_AWB_WRITE_DATA_CNT_POS)
#define DSP2_MIDDLE_AWB_WRITE_DATA_CNT_UMSK                      (~(((1U<<DSP2_MIDDLE_AWB_WRITE_DATA_CNT_LEN)-1)<<DSP2_MIDDLE_AWB_WRITE_DATA_CNT_POS))
#define DSP2_MIDDLE_AWB_STA_INT_FLAG                             DSP2_MIDDLE_AWB_STA_INT_FLAG
#define DSP2_MIDDLE_AWB_STA_INT_FLAG_POS                         (28U)
#define DSP2_MIDDLE_AWB_STA_INT_FLAG_LEN                         (1U)
#define DSP2_MIDDLE_AWB_STA_INT_FLAG_MSK                         (((1U<<DSP2_MIDDLE_AWB_STA_INT_FLAG_LEN)-1)<<DSP2_MIDDLE_AWB_STA_INT_FLAG_POS)
#define DSP2_MIDDLE_AWB_STA_INT_FLAG_UMSK                        (~(((1U<<DSP2_MIDDLE_AWB_STA_INT_FLAG_LEN)-1)<<DSP2_MIDDLE_AWB_STA_INT_FLAG_POS))

